БухЭксп/InformationRegisters/CW_ОбработчикиОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбработчикиОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыОбработчиковОбновления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимВыполнения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РежимыВыполненияОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачальноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриКаждомОбновлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформацияОбОшибке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчередьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonForms/CW_ПрогрессПервогоЗапуска/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьСписокОбработчиков();
	
КонецПроцедуры  

&НаСервере
Процедура ПодготовитьСписокОбработчиков() 
	
	ТекущаяВерсия = "0.0.0.0";    
	
	CW_ОбновлениеКонфигурацииСервер.ПриДобавленииОбработчиковОбновления();  
	
	//Получаем список всех обработчиков доступных для запуска.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбработчикиОбновления.ИмяОбработчика КАК ИмяОбработчика,
	               |	CW_ОбработчикиОбновления.ИмяПодсистемы КАК ИмяПодсистемы,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения КАК ОчередьВыполнения,
	               |	CW_ОбработчикиОбновления.Версия КАК Версия
	               |ИЗ
	               |	РегистрСведений.CW_ОбработчикиОбновления КАК CW_ОбработчикиОбновления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ОбработчикиОбновления.НачальноеЗаполнение УБЫВ,
	               |	CW_ОбработчикиОбновления.ОчередьВыполнения
	               |АВТОУПОРЯДОЧИВАНИЕ";  
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ТаблицаОбработчиков.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ИндикаторПервогоЗапуска.МаксимальноеЗначение = ТаблицаОбработчиков.Количество();

	ПодключитьОбработчикОжидания("НачатьВыполнениеобработчиков", 0.1, Истина);
	
КонецПроцедуры    

&НаКлиенте
Процедура НачатьВыполнениеобработчиков() Экспорт 
	
	Для Каждого СтрокаТаблицы из ТаблицаОбработчиков Цикл    
		
		РезульатВыполнения = CW_ОбновлениеКонфигурацииСлужебный.ВыполнитьЗаданиеНаСервере(СтрокаТаблицы.ИмяОбработчика);  
		Если РезульатВыполнения.Состояние = "Ошибка" Тогда
			ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковОшибка", 1, Истина);
			Возврат;
		КонецЕсли; 
		
		Результат = ПолучитьИзВременногоХранилища(РезульатВыполнения.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Структура") Тогда 
			ИндикаторПервогоЗапуска = ИндикаторПервогоЗапуска + 1; 
			ОбновитьОтображениеДанных(Элементы.ИндикаторПервогоЗапуска);   
		КонецЕсли;  
		
		ИндикаторПервогоЗапуска = ИндикаторПервогоЗапуска + 1; 
		ОбновитьОтображениеДанных(Элементы.ИндикаторПервогоЗапуска);    
		
	КонецЦикла; 
	
	ПодключитьОбработчикОжидания("ЗавершитьВыполнениеОбработчиковУспешно", 1, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковУспешно() Экспорт 
	
	ЭтаФорма.Закрыть("Успешно");
	
КонецПроцедуры 

&НаКлиенте
Процедура ЗавершитьВыполнениеОбработчиковОшибка() Экспорт 
	
	ЭтаФорма.Закрыть("Ошибка");
	
КонецПроцедуры
